modm-ext/data.modm.io/docs/svd/header_stm32g431xx.svd
        <register>
          <name>RG1CR</name>
          <description>DMA Request Generator x Control Register</description>
          <addressOffset>0x104</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SIG_ID</name>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>OIE</name>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GE</name>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPOL</name>
              <bitOffset>17</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>GNBREQ</name>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RG2CR</name>
          <description>DMA Request Generator x Control Register</description>
          <addressOffset>0x108</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SIG_ID</name>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>OIE</name>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GE</name>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPOL</name>
              <bitOffset>17</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>GNBREQ</name>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RG3CR</name>
          <description>DMA Request Generator x Control Register</description>
          <addressOffset>0x10c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SIG_ID</name>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>OIE</name>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GE</name>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPOL</name>
              <bitOffset>17</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>GNBREQ</name>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RGSR</name>
          <description>DMA Request Generator Status Register</description>
          <addressOffset>0x140</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>OF0</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OF1</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OF2</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OF3</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RGCFR</name>
          <description>DMA Request Generator Clear Flag Register</description>
          <addressOffset>0x144</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>COF0</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COF1</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COF2</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COF3</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>CORDIC</name>
      <description>CORDIC</description>
      <groupName>CORDIC</groupName>
      <baseAddress>0x40020c00</baseAddress>
      <interrupt>
        <name>CORDIC</name>
        <description>CORDIC global Interrupt</description>
        <value>100</value>
      </interrupt>
      <registers>
        <register>
          <name>CSR</name>
          <description>CORDIC control and status register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FUNC</name>
              <description>Function</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COSINE</name>
                  <description>Cosine</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINE</name>
                  <description>Sine</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PHASE</name>
                  <description>Phase</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODULUS</name>
                  <description>Modulus</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARCTANGENT</name>
                  <description>Arctangent</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HCOSINE</name>
                  <description>Hyperbolic Cosine</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSINE</name>
                  <description>Hyperbolic Sine</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HARCTANGENT</name>
                  <description>Hyperbolic Arctangent</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NATURALLOG</name>
                  <description>Natural Logarithm</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SQUAREROOT</name>
                  <description>Square Root</description>
                  <value>9</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRECISION</name>
              <description>Precision</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PRECISION_1CYCLE</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRECISION_2CYCLES</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRECISION_3CYCLES</name>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRECISION_4CYCLES</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRECISION_5CYCLES</name>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRECISION_6CYCLES</name>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRECISION_7CYCLES</name>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRECISION_8CYCLES</name>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRECISION_9CYCLES</name>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRECISION_10CYCLES</name>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRECISION_11CYCLES</name>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRECISION_12CYCLES</name>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRECISION_13CYCLES</name>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRECISION_14CYCLES</name>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRECISION_15CYCLES</name>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SCALE</name>
              <description>Scaling factor</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SCALE_0</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCALE_1</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCALE_2</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCALE_3</name>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCALE_4</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCALE_5</name>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCALE_6</name>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCALE_7</name>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IEN</name>
              <description>Interrupt Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMAREN</name>
              <description>DMA Read channel Enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMAWEN</name>
              <description>DMA Write channel Enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NRES</name>
              <description>Number of results in WDATA register</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NBREAD_1</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NBREAD_2</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NARGS</name>
              <description>Number of arguments in RDATA register</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NBWRITE_1</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NBWRITE_2</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESSIZE</name>
              <description>Width of output data</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OUTSIZE_32BITS</name>
                  <description>32 bits output data size (Q1.31 format)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTSIZE_16BITS</name>
                  <description>16 bits output data size (Q1.15 format)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ARGSIZE</name>
              <description>Width of input data</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INSIZE_32BITS</name>
                  <description>32 bits input data size (Q1.31 format)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INSIZE_16BITS</name>
                  <description>16 bits input data size (Q1.15 format)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RRDY</name>
              <description>Result Ready Flag</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WDATA</name>
          <description>CORDIC argument register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ARG</name>
              <description>Input Argument</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RDATA</name>
          <description>CORDIC result register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RES</name>
              <description>Output Result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
